CSI API ETABS v1
cDetailing.GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegionInfo Method
 Represents one region of Design Strip, based on strip segment and slab geometry
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegionInfo(
	int DetailingOutputIndex,
	int StripIndex,
	int DetailingRegionIndex,
	ref double X1,
	ref double Y1,
	ref double X2,
	ref double Y2,
	ref int NumberTopBars,
	ref int NumberBottomBars
)
Function GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegionInfo (
	DetailingOutputIndex As Integer,
	StripIndex As Integer,
	DetailingRegionIndex As Integer,
	ByRef X1 As Double,
	ByRef Y1 As Double,
	ByRef X2 As Double,
	ByRef Y2 As Double,
	ByRef NumberTopBars As Integer,
	ByRef NumberBottomBars As Integer
) As Integer
Dim instance As cDetailing
Dim DetailingOutputIndex As Integer
Dim StripIndex As Integer
Dim DetailingRegionIndex As Integer
Dim X1 As Double
Dim Y1 As Double
Dim X2 As Double
Dim Y2 As Double
Dim NumberTopBars As Integer
Dim NumberBottomBars As Integer
Dim returnValue As Integer
returnValue = instance.GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegionInfo(DetailingOutputIndex,
	StripIndex, DetailingRegionIndex,
	X1, Y1, X2, Y2, NumberTopBars, NumberBottomBars)
int GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegionInfo(
	int DetailingOutputIndex,
	int StripIndex,
	int DetailingRegionIndex,
	double% X1,
	double% Y1,
	double% X2,
	double% Y2,
	int% NumberTopBars,
	int% NumberBottomBars
)
abstract GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegionInfo :
        DetailingOutputIndex : int *
        StripIndex : int *
        DetailingRegionIndex : int *
        X1 : float byref *
        Y1 : float byref *
        X2 : float byref *
        Y2 : float byref *
        NumberTopBars : int byref *
        NumberBottomBars : int byref -> int
Parameters
DetailingOutputIndex
Type: System.Int32
 Detailing Output Index
StripIndex
Type: System.Int32
 Strip Index
DetailingRegionIndex
Type: System.Int32
 Detailing region index
X1
Type: System.Double
 X1 for Global location Centerline of the region
Y1
Type: System.Double
 Y1 for Global location Centerline of the region
X2
Type: System.Double
 X2 for Global location Centerline of the region
Y2
Type: System.Double
 Y2 for Global location Centerline of the region
NumberTopBars
Type: System.Int32
 Top Rebar Extents in local centerline of the region
NumberBottomBars
Type: System.Int32
 Bottom Rebar Extents in local centerline of the region
Return Value
Type: Int32
Returns zero if the function is successful; otherwise it returns a nonzero value.
See Also
Reference
cDetailing Interface
ETABSv1 Namespace